MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM064/mcu.h
extern volatile __OFF111bits_t OFF111bits __asm__ ("OFF111") __attribute__((section("sfrs"), address(0xBF8106FC)));
#define OFF112 OFF112
extern volatile uint32_t   OFF112 __attribute__((section("sfrs"), address(0xBF810700)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF112bits_t;
extern volatile __OFF112bits_t OFF112bits __asm__ ("OFF112") __attribute__((section("sfrs"), address(0xBF810700)));
#define OFF113 OFF113
extern volatile uint32_t   OFF113 __attribute__((section("sfrs"), address(0xBF810704)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF113bits_t;
extern volatile __OFF113bits_t OFF113bits __asm__ ("OFF113") __attribute__((section("sfrs"), address(0xBF810704)));
#define OFF114 OFF114
extern volatile uint32_t   OFF114 __attribute__((section("sfrs"), address(0xBF810708)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF114bits_t;
extern volatile __OFF114bits_t OFF114bits __asm__ ("OFF114") __attribute__((section("sfrs"), address(0xBF810708)));
#define OFF115 OFF115
extern volatile uint32_t   OFF115 __attribute__((section("sfrs"), address(0xBF81070C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF115bits_t;
extern volatile __OFF115bits_t OFF115bits __asm__ ("OFF115") __attribute__((section("sfrs"), address(0xBF81070C)));
#define OFF116 OFF116
extern volatile uint32_t   OFF116 __attribute__((section("sfrs"), address(0xBF810710)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF116bits_t;
extern volatile __OFF116bits_t OFF116bits __asm__ ("OFF116") __attribute__((section("sfrs"), address(0xBF810710)));
#define OFF117 OFF117
extern volatile uint32_t   OFF117 __attribute__((section("sfrs"), address(0xBF810714)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF117bits_t;
extern volatile __OFF117bits_t OFF117bits __asm__ ("OFF117") __attribute__((section("sfrs"), address(0xBF810714)));
#define OFF119 OFF119
extern volatile uint32_t   OFF119 __attribute__((section("sfrs"), address(0xBF81071C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF119bits_t;
extern volatile __OFF119bits_t OFF119bits __asm__ ("OFF119") __attribute__((section("sfrs"), address(0xBF81071C)));
#define OFF120 OFF120
extern volatile uint32_t   OFF120 __attribute__((section("sfrs"), address(0xBF810720)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF120bits_t;
extern volatile __OFF120bits_t OFF120bits __asm__ ("OFF120") __attribute__((section("sfrs"), address(0xBF810720)));
#define OFF121 OFF121
extern volatile uint32_t   OFF121 __attribute__((section("sfrs"), address(0xBF810724)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF121bits_t;
extern volatile __OFF121bits_t OFF121bits __asm__ ("OFF121") __attribute__((section("sfrs"), address(0xBF810724)));
#define OFF122 OFF122
extern volatile uint32_t   OFF122 __attribute__((section("sfrs"), address(0xBF810728)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF122bits_t;
extern volatile __OFF122bits_t OFF122bits __asm__ ("OFF122") __attribute__((section("sfrs"), address(0xBF810728)));
#define OFF123 OFF123
extern volatile uint32_t   OFF123 __attribute__((section("sfrs"), address(0xBF81072C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF123bits_t;
extern volatile __OFF123bits_t OFF123bits __asm__ ("OFF123") __attribute__((section("sfrs"), address(0xBF81072C)));
#define OFF124 OFF124
extern volatile uint32_t   OFF124 __attribute__((section("sfrs"), address(0xBF810730)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF124bits_t;
extern volatile __OFF124bits_t OFF124bits __asm__ ("OFF124") __attribute__((section("sfrs"), address(0xBF810730)));
#define OFF128 OFF128
extern volatile uint32_t   OFF128 __attribute__((section("sfrs"), address(0xBF810740)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF128bits_t;
extern volatile __OFF128bits_t OFF128bits __asm__ ("OFF128") __attribute__((section("sfrs"), address(0xBF810740)));
#define OFF129 OFF129
extern volatile uint32_t   OFF129 __attribute__((section("sfrs"), address(0xBF810744)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF129bits_t;
extern volatile __OFF129bits_t OFF129bits __asm__ ("OFF129") __attribute__((section("sfrs"), address(0xBF810744)));
#define OFF130 OFF130
extern volatile uint32_t   OFF130 __attribute__((section("sfrs"), address(0xBF810748)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF130bits_t;
extern volatile __OFF130bits_t OFF130bits __asm__ ("OFF130") __attribute__((section("sfrs"), address(0xBF810748)));
#define OFF131 OFF131
extern volatile uint32_t   OFF131 __attribute__((section("sfrs"), address(0xBF81074C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF131bits_t;
extern volatile __OFF131bits_t OFF131bits __asm__ ("OFF131") __attribute__((section("sfrs"), address(0xBF81074C)));
#define OFF132 OFF132
extern volatile uint32_t   OFF132 __attribute__((section("sfrs"), address(0xBF810750)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF132bits_t;
extern volatile __OFF132bits_t OFF132bits __asm__ ("OFF132") __attribute__((section("sfrs"), address(0xBF810750)));
#define OFF133 OFF133
extern volatile uint32_t   OFF133 __attribute__((section("sfrs"), address(0xBF810754)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF133bits_t;
extern volatile __OFF133bits_t OFF133bits __asm__ ("OFF133") __attribute__((section("sfrs"), address(0xBF810754)));
#define OFF134 OFF134
extern volatile uint32_t   OFF134 __attribute__((section("sfrs"), address(0xBF810758)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF134bits_t;
extern volatile __OFF134bits_t OFF134bits __asm__ ("OFF134") __attribute__((section("sfrs"), address(0xBF810758)));
#define OFF135 OFF135
extern volatile uint32_t   OFF135 __attribute__((section("sfrs"), address(0xBF81075C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF135bits_t;
extern volatile __OFF135bits_t OFF135bits __asm__ ("OFF135") __attribute__((section("sfrs"), address(0xBF81075C)));
#define OFF136 OFF136
extern volatile uint32_t   OFF136 __attribute__((section("sfrs"), address(0xBF810760)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF136bits_t;
extern volatile __OFF136bits_t OFF136bits __asm__ ("OFF136") __attribute__((section("sfrs"), address(0xBF810760)));
#define OFF137 OFF137
extern volatile uint32_t   OFF137 __attribute__((section("sfrs"), address(0xBF810764)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF137bits_t;
extern volatile __OFF137bits_t OFF137bits __asm__ ("OFF137") __attribute__((section("sfrs"), address(0xBF810764)));
#define OFF138 OFF138
extern volatile uint32_t   OFF138 __attribute__((section("sfrs"), address(0xBF810768)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF138bits_t;
extern volatile __OFF138bits_t OFF138bits __asm__ ("OFF138") __attribute__((section("sfrs"), address(0xBF810768)));
#define OFF139 OFF139
extern volatile uint32_t   OFF139 __attribute__((section("sfrs"), address(0xBF81076C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF139bits_t;
extern volatile __OFF139bits_t OFF139bits __asm__ ("OFF139") __attribute__((section("sfrs"), address(0xBF81076C)));
#define OFF140 OFF140
extern volatile uint32_t   OFF140 __attribute__((section("sfrs"), address(0xBF810770)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF140bits_t;
extern volatile __OFF140bits_t OFF140bits __asm__ ("OFF140") __attribute__((section("sfrs"), address(0xBF810770)));
#define OFF141 OFF141
extern volatile uint32_t   OFF141 __attribute__((section("sfrs"), address(0xBF810774)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF141bits_t;
extern volatile __OFF141bits_t OFF141bits __asm__ ("OFF141") __attribute__((section("sfrs"), address(0xBF810774)));
#define OFF142 OFF142
extern volatile uint32_t   OFF142 __attribute__((section("sfrs"), address(0xBF810778)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF142bits_t;
extern volatile __OFF142bits_t OFF142bits __asm__ ("OFF142") __attribute__((section("sfrs"), address(0xBF810778)));
#define OFF143 OFF143
extern volatile uint32_t   OFF143 __attribute__((section("sfrs"), address(0xBF81077C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF143bits_t;
extern volatile __OFF143bits_t OFF143bits __asm__ ("OFF143") __attribute__((section("sfrs"), address(0xBF81077C)));
#define OFF144 OFF144
extern volatile uint32_t   OFF144 __attribute__((section("sfrs"), address(0xBF810780)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF144bits_t;
